<template>
	<div class="agreement">
		<div class="scroll-wrap">
            <h3 class="title">
                客户端使用协议
            </h3>
            <div class="content">
                <div class="entrance-content">
                    <div class="entrance-content-tips">
                        <div class="tips-title">重要提示：</div>
                        <div class="tips-context">
                            <p>1. 本产品协议双方为明安在线（北京）医疗科技有限公司（下称“明安在线”）与明安在线客户端使用者。</p>
                            <p>2. 本协议是客户端使用者与明安在线之间的，具有法律约束力的正式协议，其内容包括客户端及服务介绍、服务流程、技术支持、客户端升级、责任豁免及其他与使用者、用户切身利益相关的内容，请使用者仔细阅读。</p>
                            <p>3．附件<!-- ：《天安人寿成长无忧少儿团体特定疾病保险条款》 --></p>
                            <p>4．无论使用者事实上是否认真阅读了本产品协议，只要使用者勾选协议下方的“我已阅读并自愿同意接受本协议全部内容”， 即视为使用者已了解并完全同意本产品协议各项内容，包括明安在线客户端对产品协议所做的任何修改。</p>
                        </div>
                    </div>
                    <div class="entrance-content-text">
                        <div class="text-abstract">
                            <p>正文</p>
                            <p>内容包括协议正文及所有明安在线客户端已经发布的或将来可能发布的各类规则。所有规则为协议不可分割的一部分，与协议正文具有同等法律效力。</p>
                            <p>使用者须确认所提供的信息真实有效，如因客户所提供的信息有误或虚假使服务中断的，明安在线对此不承担任何责任。</p>
                        </div>
                        <div class="text-content">
                            <div class="paragraph">
                                <div class="paragraph-title-firstClass">1. 定义</div>
                                <div class="paragraph-text">
                                    <p>1.1. 客户端：本协议“客户端”特指明安在线提供的可被用户在线浏览使用的的或可下载至本地的软件程序。</p>
                                    <p>1.2. 用户：本协议产品、服务的用户年龄限定在出生后28天至年满14周岁，指经其监护人或具有监护职责的人（即使用人）经“   ”客户端购买明安在线提供的产品后，最终享受相应产品服务的特定自然人。</p>
                                    <p>1.3. 使用者：指登录客户端为用户购买产品的自然人，限于用户的监护人、具有监护职责的近亲属。</p>
                                    <p>1.4. 监护人：指本协议用户根据《民法通则》具有监护职责的自然人。</p>
                                    <p>1.5. 产品：本协议“产品”特指通过“    ”客户端销售的包括但不限于电话医生、疫苗提醒、健康咨询、重疾绿色通道、重疾险、成长曲线各项服务按具体形式组合的服务综合包。</p>
                                    <p>1.6 电话医生：指使用者通过电话或在线就用户健康问题提供咨询、建议等意见的，具有一定医学临床工作经验的工作人员。</p>
                                    <p>1.7. 重疾绿色通道：指向用户提供的专家门诊快速预约、住院、手术预约服务。</p>
                                </div>
                            </div>
                            <div class="paragraph">
                                <div class="paragraph-title-firstClass">2. 产品服务及局限性</div>
                                <div class="paragraph-title-secondClass">2.1 电话医生服务 </div>
                                <div class="paragraph-text">
                                    <p>2.1.1. 服务介绍：由电话医生对用户的健康问题提供7*24小时电话医生在线健康咨询。经监护人拨打4008175566服务专线，电话医生对用户健康问题提供个性化健康咨询和常见疾病咨询（包括疾病咨询、就医指导、体检报告解读等）。</p>
                                </div>
                                <div class="paragraph-title-thirdClass">2.1.2 电话医生服务的局限性 </div>
                                <div class="paragraph-text">
                                    <p>2.1.2.1. 因咨询问题均源于咨询者的主观描述，问题的描述的客观性、准确性存在不确定性及信息传递过程造成信息的误差，故电话医生的建议可能事实上不能满足咨询者的预期。</p>
                                    <p>2.1.2.2. 健康问题的咨询建议源于在一定医学专业基础上的经验性的判断，故不同电话医生的建议可能不一致，亦与临床医生的诊疗意见亦可能不同。</p>
                                    <p>2.1.2.3. 电话医生的咨询不同于临床医生的问诊、临床查体、检查，故其咨询建议不同于诊断、治疗，不作为或视为临床诊断，不得作为药品使用的依据。</p>
                                    <p>2.1.2.4. 电话医生只能提供咨询建议，用户如出现身体不适应前往医院进行临床检查和治疗，以免延误病情。</p>
                                </div>
                                <div class="paragraph-title-thirdClass">2.1.3 电话医生仅提供医疗健康咨询，不能或拒绝提供以下咨询或问题： </div>
                                <div class="paragraph-text">
                                    <p>2.1.3.1. 出生不满28天的新生儿的所有问题；</p>
                                    <p>2.1.3.2. 非医疗健康类问题，如动物疾病问题、社会意识形态问题等；</p>
                                    <p>2.1.3.3. 医疗司法举证或询证问题；</p>
                                    <p>2.1.3.4. 胎儿性别鉴定问题；</p>
                                    <p>2.1.3.5. 有危害他人/自己可能的问题；</p>
                                    <p>2.1.3.6. 医生个人信息的问题；</p>
                                    <p>2.1.3.7. 故意挑逗、侮辱医生的提问。</p>
                                </div>
                                <div class="paragraph-title-secondClass">2.2 健康资讯</div>
                                <div class="paragraph-text">
                                    <p>2.2.1. 本客户端提供适龄儿童相关的健康护理类科普知识，如涉及任何医疗信息，亦仅供参考，不能被视为医生或其他医务人员的诊疗意见。</p>
                                    <p>2.2.2. 明安在线致力于提供正确、完整的健康资讯，但健康资讯及医学科学均不断更新、进步，且健康知识源于统计数据适用于一定的人群，明安在线不能保证信息的正确性、完整性及对用户的个体适用性。</p>
                                    <p>2.2.3. 因新生儿、婴幼儿及儿童病情变化快，须经专业医务人员临床诊疗，故如用户出现身体不适，请意即前往正规医疗机构进行诊断治疗，以免贻误病情。</p>
                                    <p>2.2.4. 本平台的提供的科普类知识不能作为诊疗意见，用户或监护人不能以此咨讯信息为依据对用户进行诊疗、用药或采取护理措施；如因对健康咨讯理解或使用不当引起不良后果，监护人同意自行承担相应后果，并不以健康咨讯服务为由追究明安在线的法律责任。</p>
                                </div>
                                <div class="paragraph-title-secondClass">2.3 疫苗提醒</div>
                                <div class="paragraph-text">
                                    <p>2.3.1. 本服务将提供计划免疫接种程序及其提醒功能，以及相关传染病的科普知识，最终接种事宜以接种医生意见为准。在使用本服务前，使用者保证已仔细阅读本服务中提供的接种疫苗相关知识及注意事项。</p>
                                    <p>2.3.2. 本服务不提供计划外免疫接种程序及其提醒功能。</p>
                                    <p>2.3.3. 疫苗接种应以接种医生结合接种者的身体状况决定是否接种疫苗，如用户出现身体不适或使用过药物的，应主动告知接种医生，绝不可按照疫苗提醒的时间接种。</p>
                                    <p>2.3.4.在接种疫苗前，使用者应仔细阅读接种医疗机构提供的知情同意书，因接种疫苗产生不良反应等纠纷请与接种医疗机构联系并依法解决。</p>
                                    <p>2.3.5. 本服务的使用不构成接种疫苗的诊疗意见，是否应当接种疫苗应由医疗机构结合用户的健康状况作出专业判断，使用者不得以疫苗提醒或科普知识自行判断。</p>
                                </div>
                                <div class="paragraph-title-secondClass">2.4 重疾绿色通道</div>
                                <div class="paragraph-title-thirdClass">2.4.1 服务介绍</div>
                                <div class="paragraph-text">
                                    <p>2.4.1.1. 服务期限：详见服务说明。</p>
                                    <p>2.4.1.2. 服务内容：为用户在服务期限内提供专家门诊快速预约服务、住院、手术预约服务各一次，可提供服务的医院及疾病种类详见具体服务说明。</p>
                                    <p>服务项目及能力：</p>
                                    <p>1）专家门诊预约：</p>
                                    <p>a. 预约用户的就诊时间：除使用者主动要求外，预约成功的就诊时间将限制在用户申请资料审核成功之日起10个工作日内。</p>
                                    <p>b.预约用户的就诊时间：除使用者主动要求外，预约成功的就诊时间将限制在用户申请资料审核成功之日起10个工作日内。</p>
                                    <p>2）住院预约</p>
                                    <p>a. 如用户有住院需求的，且在可提供服务的医院列表范围内的，明安在线自收到用户申请起5个工作日内帮其安排其住院及床位，并协助用户办理住院手续；</p>
                                    <p>2.4.1.3.特殊说明：</p>
                                    <p>b. 在住院过程中，使用者有电话医生需求的，电话医生将定期与用户进行电话沟通，并根据病情与专家沟通相关治疗方案；</p>
                                    <p>c. 在用户出院后7个工作日内，明安在线电话医生将通过电话跟进康复情况及效果，并根据实际情况给出适当的保健建议。</p>
                                    <p>3）手术预约</p>
                                    <p>用户有手术需求时，且在可提供服务的医院列表范围内的，明安在线自收到用户申请起7个工作日内安排手术；如使用者有特殊的专家要求，明安在线在用户提出需求后的10个工作日内安排手术。</p>
                                    <p>2.4.1.3.1. 因就医绿通服务不适用于紧急危重患者，使用者在预约时应首先到当地医疗机构就诊，以避免等待期造成用户延误诊疗；在预约等待期内，如用户病情出现变化，使用者或监护人应根据用户的健康状况或病情及时到当地医疗机构就诊，以免贻误病情。</p>
                                    <p>2.4.1.3.2. 在预约医疗机构时如需要用户证件、信息时，经明安在线或其指定第三方将提前通知，使用者应按照明安在线或其指定第三方要求提供该证照及信息。</p>
                                    <p>2.4.1.3.3. 预约的医疗机构在用户实际就诊时需提供的资料由使用者提供，用户知道并理解应提前向医疗机构咨询并准备相应的资料，以避免因证照、资料不完整导致不能按时就诊、实施诊疗或导致费用不能经保险支付、理赔等。</p>
                                    <p>2.4.1.3.4. 因预约医疗机构临时出现变化的，使用者同意明安在线根据使用者申请时的需求预约同等资历专家。如使用者拒绝接受同等资历专家，使用者可重新提请预约服务，但预约时间将重新计算。</p>
                                    <p>2.4.1.3.5. 明安在线只提供预约服务，预约成功后的诊疗服务将由用户就诊的医疗机构直接向用户提供，费用由用户直接向医疗机构支付，其与明安在线之间无事实和法律关系。</p>
                                    <p>2.4.1.3.6. 使用者已知道并理解其应按照预约信息准时前往预约的医疗机构就诊，如因迟到导致不能成功就诊仍视为明安在线已完成预约服务。</p>
                                    <p>2.4.1.3.7. 使用者同意因用户方的原因导致已预约成功的服务未能实际享受，则该预约服务仍视为明安在线已实际提供，使用者不得以未实际享受服务为由要求再次提供。</p>
                                </div>
                                <div class="paragraph-title-secondClass">2.5 成长曲线</div>
                                <div class="paragraph-text">
                                    <p>2.5.1.成长曲线服务将按照标准范围进行健康值比照，以了解7岁以下适龄儿童成长发育的当前情况。</p>
                                    <p>2.5.2.标准来源于二〇〇九年九月卫生部妇幼保健与社区卫生司发布的《中国7岁以下儿童生长发育参照标准》。如标准更新或新的标准颁布，明安在线将更新比照标准并不通知使用者。</p>
                                    <p>2.5.3.成长曲线数据的真实性、完整性由使用者及监护人负责。用户监护人理解成长曲线数据不能作为临床诊断，用户的健康情况应以医生意见为准。</p>
                                </div>
                                <div class="paragraph-title-secondClass">2.6 重疾险</div>
                                <div class="paragraph-text">
                                    <p>2.6.1.重疾险指明安在线为用户投保的<!-- ，由天安人寿保险股份有限公司承保的《天安人寿成长无忧少儿团体特定疾病保险条款》 -->保险。明安在线为用户缴纳保险费用，是用户重疾险保险合同的投保人；<!-- 天安人寿保险股份有限公司承担赔偿或给付保险金责任的保险，是用户特定疾病保险合同的保险人； -->用户是重疾险的被保险人和受益人，在其未成年之前，其权利只能由监护人代为主张。</p>
                                    <p>使用者在客户端的“客户端使用协议”中勾选“我已阅读并同意以上协议”，即视为使用者知晓并同意明安在线为用户投保。</p>
                                    <p>2.6.2.重疾险的具体保险范围、理赔及免责等以保险合同为准。用户及监护人保证认真阅读保险合同，理解保险合同的条款，知道保险理赔的程序及权利、免赔条款。</p>
                                </div>
                                <div class="paragraph-title-thirdClass">2.6.3 重疾险的重要条款：</div>
                                <div class="paragraph-text">
                                    <p>2.6.3.1. 被保险人因下列情形之一发生本合同所指的特定疾病的，保险人不承担保险责任：</p>
                                    <p>①　主动吸食或注射毒品；</p>
                                    <p>②　故意自伤、故意犯罪或抗拒依法采取的刑事强制措施；</p>
                                    <p>③　酒后驾驶、无合法有效驾驶证驾驶或驾驶无有效行驶证的机动车；</p>
                                    <p>④　战争、军事冲突、暴乱或武装叛乱；</p>
                                    <p>⑤　核爆炸、核辐射或核污染；</p>
                                    <p>⑥　遗传性疾病，先天性畸形、变形或染色体异常；</p>
                                    <p>⑦　感染艾滋病病毒或患艾滋病。</p>
                                    <p>2.6.3.2. 被保险人因上述第1项情形发生本合同所指的特定疾病的，保险人对该被保险人的保险责任终止，并向该被保险人退还其对应的现金价值。</p>
                                    <p>2.6.3.3. 被保险人因上述第2-8项情形之一发生本合同所指的特定疾病的，保险人对该被保险人的保险责任终止，并向投保人退还该被保险人对应的现金价值。</p>
                                </div>
                                <div class="paragraph-title-thirdClass">2.6.4. 监护人在申请理赔时所依据的程序、流程及应提供的资料以保险合同、保险人的需要为准，明安在线不负责理赔亦不承担赔偿或给付的责任，但对用户的理赔提供必要的协助。</div>
                            </div>
                            <div class="paragraph">
                                <div class="paragraph-title-firstClass">3. 客户端登录</div>
                                <div class="paragraph-text">
                                    <p>3.1. 因登录明安在线客户端成为使用者时，将要求使用者设置手机号码（即：使用者名）和随机验证码来识别使用者身份。使用者应使用本人的实名手机号码并保证手机号码正常使用，否则使用者账户因非实名认证将可能被明安在线依法予以暂停、注销。如手机号码不能正常使用，使用者将可能因随机验证码不能接收将导致不能使用本客户端。</p>
                                    <p>3.2. 如移动设备丢失或手机号码信息泄漏，使用者可能会丢失识别信息及用户信息，并可能导致对使用者、用户不利的后果。如账户因任何原因受到潜在或现实危险时，使用者应立即与明安在线取得联系，但在明安在线客户端采取行动前，明安在线不能保证使用者使用不受影响或不遭受损失。</p>
                                    <p>3.3. 使用者只能将其被监护人指定为用户，不得将其他未成年人指定为用户，否则明安在线有权不通知使用者直接暂停或终止其使用客户端或享受产品服务，并不退款或承担任何赔偿、补偿责任。如因使用者指定其他未成年人为用户导致投诉、法律纠纷、赔偿的，其法律责任将直接由使用者承担。</p>
                                    <p>3.4. 使用者在客户端中填写信息时，应当保证信息的真实、有效、完整后再提交。明安在线将以客户端中记载信息为准识别用户、被保险人并对该用户、被保险人提供产品服务。如因使用者填写信息与真实信息不一致导致使用者指定用户不能享受产品服务或保险理赔的，相应责任由使用者自行承担。在使用者、用户信息依法变更时应及时提交相应的变更材料并通知明安在线客户端管理员进行更新，否则可能导致客户端不能正常使用或用户不能享受服务、理赔等。</p>
                                    <p>3.5. 使用者在申请收费服务前，务必详细阅读明安在线客户端网页上的信息，并严格按要求操作。使用者在订购客户端产品时，应当以其合法持有账户进行支付。</p>
                                    <p>3.6. 发票及账单：账单已订购时生成的订单为准，明安在线为客户提供电子发票，请登录或点击相关链接。</p>
                                    <p>3.7. 使用者同意明安在线及明安在线授权提供服务的第三方通过向注册手机号码发送短信的形式验证账户、提供与客户端使用或产品服务相关的资讯。</p>
                                </div>
                            </div>
                            <div class="paragraph">
                                <div class="paragraph-title-firstClass">4. 客户端使用规则</div>
                                <div class="paragraph-text">
                                    <p>4.1. 明安在线依法有权利相关数据、所有的申请行为以及与咨询有关的其它事项进行审查，如使用者向明安在线咨询或告知的内容如涉及违法或侵害他人权利不当行为的，明安在线有权不通知使用者直接删除信息，暂停或注销使用者账号并追究相关法律责任。</p>
                                    <p>4.2. 因用户未年满18周岁，属于无民事行为能力人或限制民事行为能力人，其依据本协议享有的权利、承担的义务或实施的行为，其法律后果将依法由使用人承担。</p>
                                    <p>4.3. 使用者进行咨询、投诉或在线发表意见时，应使用在咨询过程中应使用文明用语，不得违反法律法规或侵犯第三人合法权益，否则明安在线有权删除相关信息、拒绝提供服务、暂停或注销使用者等。</p>
                                </div>
                            </div>
                            <div class="paragraph">
                                <div class="paragraph-title-firstClass">5. 客户端维护</div>
                                <div class="paragraph-text">
                                    <p>5.1. 如客户端因技术上难以克服的故障或第三方行为导致不能正常运行或时间延误、或所提供的内容、数据或信息出现错误或不准确之处时，可能导致使用者对产品服务的使用；使用者可选择人工客服寻求解决或提供服务，明安在线将尽力采取补救措施，但不保证完全避免不良影响或后果的出现。</p>
                                    <p>5.2. 明安在线不担保本客户端所包含的或以其它方式通过本客户端提供给您的全部信息、内容、材料、产品（包括软件）和服务、其服务器或从本客户端发出的电子信件、信息没有病毒或其他有害成分。如因不可抗力或其它本站无法控制的原因使本客户端销售系统崩溃或无法正常使用导致网上交易无法完成或丢失有关的信息、记录等，明安在线会合理地尽力协助处理善后事宜。</p>
                                    <p>5.3. 明安在线保证提供安全、稳定的服务场所，努力提升技术及改进技术，尽力维护客户端正常运行。但因下列状况导致客户端无法正常运作时，明安在线不承担损害赔偿责任，该状况包括但不限于：</p>
                                    <p>5.3.1. 明安在线已在客户端提前24小时公告客户端停机维护期间；</p>
                                    <p>5.3.2. 电信设备出现故障不能进行数据传输的；</p>
                                    <p>5.3.3. 因台风、地震、海啸、洪水、停电、战争、恐怖袭击等不可抗力之因素，造成系统障碍不能执行业务的；</p>
                                    <p>5.3.4. 由于黑客攻击、电信部门技术调整或故障、网站升级、银行方面的问题等原因而造成的服务中断或者延迟；</p>
                                    <p>5.3.5. 其他明安在线无法预知、不能控制或不能制止的事由。</p>
                                </div>
                            </div>
                            <div class="paragraph">
                                <div class="paragraph-title-firstClass">6. 隐私权保护</div>
                                <div class="paragraph-text">
                                    <p>6.1. 明安在线在使用者登录、使用客户端，用户使用产品服务时时，可能收集相关信息（以下称用户资料），包括但不限于姓名、地址、电话号码、电子邮件地址、联系方式、出生日期、用户身体信息（身高、体重、心率等）、健康信息、运动信息、病历资料、身份信息等。</p>
                                    <p>6.2. 明安在线承诺只在为用户提供服务或改进客户端、服务而与第三方供应商分享必要的用户资料。</p>
                                    <p>6.3. 明安在线客户端将对用户资料实行严格的保密制度，承诺一定不会公开、编辑或透露其注册资料及保存在明安在线客户端中的非公开内容，除非出现以下任一情况：</p>
                                    <p>6.3.1. 经使用户同意向第三方披露。</p>
                                    <p>6.3.2. 经第三人投诉或司法机关通知，使用者并非用户之监护人或依法具有监护职责的人，明安在线向投诉讼人或司法机关提供使用者部分信息，以便解决可能的权利纠纷。</p>
                                    <p>6.3.3. 根据法律的有关规定，或者行政或司法机构的要求，向第三方或者行政、司法机构披露。</p>
                                    <p>6.3.4. 如用户出现违反中国有关法律或者网站政策的情况，需要向第三方披露。</p>
                                    <p>6.3.5. 为向用户提供产品服务，须向第三方如电话医生、就医绿通服务者、预约的医疗机构、客户服务机构等必要的分享用户的个人信息。</p>
                                    <p>6.3.6. 向承保的保险公司、理赔人员、代理机构提供用户的个人信息</p>
                                    <p>6.3.7. 明安在线根据法律法规或者已公示的规则作出的披露。</p>
                                    <p>6.4.8 明安在线将尽力保障客户端的安全使用，避免用户资料被盗取、泄露或非正当的使用。</p>
                                </div>
                            </div>
                            <div class="paragraph">
                                <div class="paragraph-title-firstClass">7. 客户服务</div>
                                <div class="paragraph-title-secondClass">7.1 售后：</div>
                                <div class="paragraph-text">
                                    <p>7.2. 明安在线将设立线上、线下的客户服务渠道。使用者可以通过客户服务提出建议、意见或要求。如使用者对服务内容不满意，可以向明安在线提出投诉，明安在线将根据客户响应流程积极反馈，处理。</p>
                                    <p>7.3. 明安在线有义务依据情况协调第三方供应商、外聘人员，以保证用户享受优质良好的服务。</p>
                                    <p>7.4. 明安在线对用户的保险理赔提供必要的协助，帮助用户与保险人进行沟通。</p>
                                </div>
                            </div>
                            <div class="paragraph">
                                <div class="paragraph-title-firstClass">8. 所有权及知识产权条款</div>
                                <div class="paragraph-text">
                                    <p>8.1. 使用者一旦接受本协议，即表明该使用者主动将其在任何时间段在本客户端发表的任何形式的信息内容（包括但不限于客户评价、客户咨询、各类话题文章等信息内容）的财产性权利等任何可转让的权利，如著作权财产权（包括并不限于：复制权、发行权、出租权、展览权、表演权、放映权、广播权、信息网络传播权、摄制权、改编权、翻译权、汇编权以及应当由著作权人享有的其他可转让权利），全部独家且不可撤销地转让给明安在线所有，使用者同意明安在线有权就任何主体侵权而单独提起诉讼。</p>
                                    <p>8.2. 本协议已经构成《中华人民共和国著作权法》第二十五条（条文序号依照2011年版著作权法确定）及相关法律规定的著作财产权等权利转让书面协议，其效力及于使用者在明安在线客户端上发布的任何受著作权法保护的作品内容，无论该等内容形成于本协议订立前还是本协议订立后。</p>
                                    <p>8.3. 使用者同意并已充分了解本协议的条款，承诺不将已发表于本客户端的信息，以任何形式发布或授权其它主体以任何方式使用（包括但限于在各类网站、媒体上使用）。</p>
                                    <p>8.4. 明安在线是本客户端的制作者，拥有此客户端内容及资源的著作权等合法权利，受国家法律保护，有权不时地对本协议及本客户端的内容进行修改，并在本客户端张贴，无须另行通知使用者。在法律允许的最大限度范围内，明安在线对本协议及本客户端内容拥有解释权。</p>
                                    <p>8.5. 除法律另有强制性规定外，未经明安在线明确的特别书面许可，任何单位或个人不得以任何方式非法地全部或部分复制、转载、引用、链接、抓取或以其他方式使用本客户端的信息内容，否则，明安在线有权追究其法律责任。</p>
                                    <p>8.6. 本客户端所刊登的资料信息（诸如文字、图表、标识、按钮图标、图像、声音文件片段、数字下载、数据编辑和软件），均是明安在线或其内容提供者的财产，受中国和国际版权法的保护。本客户端上所有内容的汇编是明安在线的排他财产，受中国和国际版权法的保护。本客户端上所有软件都是明安在线或其关联公司或其软件供应商的财产，受中国和国际版权法的保护。</p>
                                </div>
                            </div>
                            <div class="paragraph">
                                <div class="paragraph-title-firstClass">9. 责任限制及不承诺担保</div>
                                <div class="paragraph-text">
                                    <p>9.1. 除非另有明确的书面说明，本客户端及其所包含的或以其它方式通过本客户端提供给您的全部信息、内容、材料、产品（包括软件）和服务，均是在“按现状”和“按现有”的基础上提供的。除非另有明确的书面说明，明安在线不对本客户端的运营及其包含在本客户端上的信息、内容、材料、产品（包括软件）或服务作任何形式的、明示或默示的声明或担保（根据中华人民共和国法律另有规定的以外）。</p>
                                    <p>9.2. 明安在线所承载的内容（文、图、视频、音频）均为传播有益健康资讯目的，不对其真实性、科学性、严肃性做任何形式保证。</p>
                                </div>
                                <p>9.3. 明安在线保留对本声明作出不定时修改的权利。</p>
                            </div>
                            <div class="paragraph">
                                <div class="paragraph-title-firstClass">10. 法律适用与管辖</div>
                                <div class="paragraph-text">
                                    <p>10.1. 本协议之效力、解释、变更、执行与争议解决均适用中华人民共和国法律。</p>
                                    <p>10.2. 因本协议产生之争议，均应依照中华人民共和国法律予以处理。</p>
                                    <p>10.3. 如双方就本服务条款内容或其执行发生任何争议，双方应尽量友好协商解决；协商不成时，任何一方均可向明安在线客户端所在地北京市朝阳区的人民法院提起诉讼。</p>
                                </div>
                            </div>
                            <div class="paragraph">
                                <div class="paragraph-title-firstClass">11. 明安在线介绍</div>
                                <div class="paragraph-title-secondClass">11.1. 公司介绍</div>
                                <div class="paragraph-text">
                                    <p>本客户端为明安在线（北京）医疗科技有限公司所有，公司经营范围为技术开发；技术服务；技术推广；经济贸易咨询；健康咨询（须经审批的诊疗活动除外）；计算机系统集成服务；基础软件服务（不含医用软件）；销售（不含零售）医疗器械、专用设备；设计、制作、代理、发布广告；互联网信息服务。（企业依法自主选择经营项目，开展经营活动；互联网信息服务以及依法须经批准的项目，经相关部门批准后依批准的内容开展经营活动；不得从事本区产业政策禁止和限制类项目的经营活动。）</p>
                                </div>
                                <div class="paragraph-title-secondClass">11.2. 联系信息</div>
                                <div class="paragraph-text">
                                    <p>北京市通州区嘉创二路55号1幢1层101-13室</p>
                                </div>
                            </div>
                        </div>
                    </div>
                </div>
            </div>
            <div class="checkbox">
                <label for="checkbox">
                    <input 
                        name="checkbox" 
                        id="checkbox" 
                        type="checkbox" 
                        v-model="status" 
                        @change="changeEntrance" 
                    />
                    我已阅读并同意以上协议
                </label>
            </div>
        </div>
        <div class="btn">
            <button @click="nextStep">下一步</button>
        </div>
	</div>
</template>

<script>
	export default {
		props: {
			isCheck: {
				type: Boolean,
				default: false
			}
		},
		data() {
			return {
				status: this.isCheck
			}
		},
		methods: {
			changeEntrance() {
				this.$emit('changeStatus', this.status)
            },
            nextStep() {
                if(!this.status) {
					console.log('请勾选协议')
					document.querySelector('.scroll-wrap').scrollTop = 100000
					return 
				} else {
                    this.$router.push('/order/info')
                }
            }
		}
	}
</script>

<style lang="scss" scoped>
	@mixin flex($justify: center, $align: center) {
		display: flex;
		justify-content: $justify;
		align-items: $align;
	}
	
	.agreement {
		position: absolute;
		top: 1.74rem;
		left: 0;
		right: 0;
		bottom: 0;
		background: #fff;
        .scroll-wrap {
            position: absolute;
            top: 0;
            left: 0;
            right: 0;
            bottom: 1rem;
		    overflow: auto;
		    -webkit-overflow-scrolling: touch;
        }
		.title {
			height: .88rem;
			line-height: .88rem;
			font-size: .32rem;
			color: #1e1e1e;
			text-align: center;
			background: #fff;
            border-bottom: 1px solid #efefef;
		}
		.entrance-content {
			line-height: 1.8;
		}
		.entrance-content-tips, 
		.abstract, 
		.text-abstract, 
		.text-content {
			text-indent: 2em;
		}
		.entrance-content-tips, 
		.entrance-content-text {
			width: 7.1rem;
			margin: auto;
		}
		.tips-title, 
		.text-abstract p:first-child, 
		.paragraph-title-firstClass {
			font-weight: bold;
			line-height: 3;
			font-size: 24px;
		}
		.paragraph-title-thirdClass {
			font-size: 20px;
			// font-weight: bold;
		}
		p {
			word-break: break-all;
			font-size: 20px;
		}
		.checkbox {
			height: .88rem;
			@include flex;
			font-size: 24px;
			label {
				width: 100%;
				height: 100%;
				@include flex;
			}
			input {
				display: block;
				width: .4rem;
				height: .4rem;
			}
		}
	}
    .btn {
        position: absolute;
        left: 0;
        right: 0;
        bottom: 0;
        width: 100%;
        height: 1rem;
        button {
            width: 100%;
            height: 100%;
            background-color: #f7aa2b;
            color: #fff;
            @include flex;
            font-size: 24px;
        }
    }
</style>

